# FabricationPartCannotChangeTypeBadDimError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationPartCannotChangeTypeBadDimError Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
The selected fitting(s) cannot successfully change the type. The newly selected fabrication part may have badly configured dimensions or be constrained due to connected fitting(s). You may try to disconnect the connections on the fitting(s) and try again.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationPartCannotChangeTypeBadDimError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPartCannotChangeTypeBadDimError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationPartCannotChangeTypeBadDimError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace